In [2]:
pwd

'C:\\Users\\USER\\Desktop\\Pandas_Assignment'

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('Rural_Urban_Population_By_Age_Sex_and_by_District__2009.csv')
df.head()

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
0,NAIROBI WEST,Urban,0,10126,10116,20242,Nairobi,NAIROBI,0
1,NAIROBI WEST,Urban,1,8124,7989,16113,Nairobi,NAIROBI,1
2,NAIROBI WEST,Urban,2,8462,8627,17089,Nairobi,NAIROBI,2
3,NAIROBI WEST,Urban,3,8334,8420,16754,Nairobi,NAIROBI,3
4,NAIROBI WEST,Urban,4,7948,7820,15768,Nairobi,NAIROBI,4

In [5]:
df.tail()

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
25415,TESO SOUTH,Rural,77,99,86,185,Busia,WESTERN,25415
25416,TESO SOUTH,Rural,78,63,47,110,Busia,WESTERN,25416
25417,TESO SOUTH,Rural,79,90,121,211,Busia,WESTERN,25417
25418,TESO SOUTH,Rural,80+,384,391,775,Busia,WESTERN,25418
25419,TESO SOUTH,Rural,Age NS,25,23,48,Busia,WESTERN,25419

In [6]:
df.columns

Index(['District', 'Urban/Rural', 'Age_years', 'Male', 'Female', 'Total',
       'County', 'Province', 'OBJECTID'],
      dtype='object')

In [7]:
df.shape

(25420, 9)

In [8]:
df.dtypes

District       object
Urban/Rural    object
Age_years      object
Male            int64
Female          int64
Total           int64
County         object
Province       object
OBJECTID        int64
dtype: object

In [9]:
df.describe

<bound method NDFrame.describe of            District Urban/Rural Age_years   Male  Female  Total   County  \
0      NAIROBI WEST       Urban         0  10126   10116  20242  Nairobi
1      NAIROBI WEST       Urban         1   8124    7989  16113  Nairobi
2      NAIROBI WEST       Urban         2   8462    8627  17089  Nairobi
3      NAIROBI WEST       Urban         3   8334    8420  16754  Nairobi
4      NAIROBI WEST       Urban         4   7948    7820  15768  Nairobi
...             ...         ...       ...    ...     ...    ...      ...
25415    TESO SOUTH       Rural        77     99      86    185    Busia
25416    TESO SOUTH       Rural        78     63      47    110    Busia
25417    TESO SOUTH       Rural        79     90     121    211    Busia
25418    TESO SOUTH       Rural       80+    384     391    775    Busia
25419    TESO SOUTH       Rural    Age NS     25      23     48    Busia

      Province  OBJECTID
0      NAIROBI         0
1      NAIROBI         1
2      NAIROBI         2
3      NAIROBI         3
4      NAIROBI         4
...        ...       ...
25415  WESTERN     25415
25416  WESTERN     25416
25417  WESTERN     25417
25418  WESTERN     25418
25419  WESTERN     25419

[25420 rows x 9 columns]>

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25420 entries, 0 to 25419
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   District     25420 non-null  object
 1   Urban/Rural  25420 non-null  object
 2   Age_years    25420 non-null  object
 3   Male         25420 non-null  int64
 4   Female       25420 non-null  int64
 5   Total        25420 non-null  int64
 6   County       25420 non-null  object
 7   Province     25420 non-null  object
 8   OBJECTID     25420 non-null  int64
dtypes: int64(4), object(5)
memory usage: 1.7+ MB

In [11]:
df.isna().mean()

District       0.0
Urban/Rural    0.0
Age_years      0.0
Male           0.0
Female         0.0
Total          0.0
County         0.0
Province       0.0
OBJECTID       0.0
dtype: float64

In [12]:
df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
25415    False
25416    False
25417    False
25418    False
25419    False
Length: 25420, dtype: bool

In [81]:
df.duplicated().sum()

0

In [14]:
df.head()

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
0,NAIROBI WEST,Urban,0,10126,10116,20242,Nairobi,NAIROBI,0
1,NAIROBI WEST,Urban,1,8124,7989,16113,Nairobi,NAIROBI,1
2,NAIROBI WEST,Urban,2,8462,8627,17089,Nairobi,NAIROBI,2
3,NAIROBI WEST,Urban,3,8334,8420,16754,Nairobi,NAIROBI,3
4,NAIROBI WEST,Urban,4,7948,7820,15768,Nairobi,NAIROBI,4

In [15]:
df['Age_years'].isnull()

0        False
1        False
2        False
3        False
4        False
         ...
25415    False
25416    False
25417    False
25418    False
25419    False
Name: Age_years, Length: 25420, dtype: bool

In [16]:
#What was the average age of a person of Kenya?
df['Age_years'].nunique()

82

In [17]:
df['Age_years'].unique()

array(['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12',
       '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23',
       '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34',
       '35', '36', '37', '38', '39', '40', '41', '42', '43', '44', '45',
       '46', '47', '48', '49', '50', '51', '52', '53', '54', '55', '56',
       '57', '58', '59', '60', '61', '62', '63', '64', '65', '66', '67',
       '68', '69', '70', '71', '72', '73', '74', '75', '76', '77', '78',
       '79', '80+', 'Age NS'], dtype=object)

In [18]:
Age_NS = df[df['Age_years'] == 'Age NS']
Age_NS.shape

(310, 9)

In [19]:
Age_80 = df[df['Age_years'] == '80+']
Age_80.shape

(310, 9)

In [20]:
df.shape

(25420, 9)

In [21]:
Age_use = df.loc[(df['Age_years'] != 'Age NS') & (df['Age_years'] != '80+')]
Age_use.shape

(24800, 9)

In [22]:
Age_use['Age_years'] = pd.to_numeric(Age_use['Age_years'])
Age_use.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 24800 entries, 0 to 25417
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   District     24800 non-null  object
 1   Urban/Rural  24800 non-null  object
 2   Age_years    24800 non-null  int64
 3   Male         24800 non-null  int64
 4   Female       24800 non-null  int64
 5   Total        24800 non-null  int64
 6   County       24800 non-null  object
 7   Province     24800 non-null  object
 8   OBJECTID     24800 non-null  int64
dtypes: int64(5), object(4)
memory usage: 1.9+ MB

C:\Users\USER\AppData\Local\Temp\ipykernel_8388\1449947632.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Age_use['Age_years'] = pd.to_numeric(Age_use['Age_years'])

In [23]:
df.nunique()

District         158
Urban/Rural        2
Age_years         82
Male            3798
Female          3819
Total           5696
County            47
Province           8
OBJECTID       25420
dtype: int64

In [24]:
Age_use['Age_years'].mean()

39.5

In [25]:
# What was the average female population in Kenya?
Avg_female = df['Female'].mean()
print(Avg_female)

763.8725019669552

In [26]:
#What was the average male population in Kenya?
Avg_male = df['Male'].mean()
print(Avg_male)

755.0140833988985

In [27]:
df.groupby("District").sum().sort_values("Total", ascending=False).head()

C:\Users\USER\AppData\Local\Temp\ipykernel_8388\893428468.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("District").sum().sort_values("Total", ascending=False).head()

                 Male  Female    Total  OBJECTID
District
NAIROBI EAST   582554  561862  1144416     10045
NAIROBI NORTH  545701  516385  1062086     16769
NAIROBI WEST   352227  332538   684765      3321
SIAYA          257711  292513   550224   2009943
MOLO           271954  270149   542103   2723138

In [28]:
# Which 5 districts were the most densely populated Kenya in descending order?
Top_district = df.groupby('District').sum().sort_values('Total', ascending=False)
Top_district.head(5)

C:\Users\USER\AppData\Local\Temp\ipykernel_8388\886778731.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  Top_district = df.groupby('District').sum().sort_values('Total', ascending=False)

                 Male  Female    Total  OBJECTID
District
NAIROBI EAST   582554  561862  1144416     10045
NAIROBI NORTH  545701  516385  1062086     16769
NAIROBI WEST   352227  332538   684765      3321
SIAYA          257711  292513   550224   2009943
MOLO           271954  270149   542103   2723138

In [29]:
df['County'].value_counts()

Kiambu             1476
Kakamega           1148
Meru               1148
Busia               820
Kisii               820
Bungoma             820
Nandi               820
Wajir               656
Garissa             656
Makueni             656
Machakos            656
Kitui               656
Baringo             656
Migori              656
Marsabit            656
Nakuru              656
Laikipia            492
Trans Nzoia         492
Narok               492
Kajiado             492
Bomet               492
Vihiga              492
Samburu             492
West Pokot          492
Turkana             492
Nyamira             492
Uasin Gishu         492
Mandera             492
Homa Bay            492
Kisumu              492
Siaya               492
Murang'a            492
Kwale               492
Kilifi              492
Nyeri               328
Kericho             328
Tana River          328
Nairobi             328
Taita Taveta        328
Elgeyo Marakwet     328
Isiolo              328
Embu                328
Nyandarua           328
Tharaka Nithi       164
Mombasa             164
Kirinyaga           164
Lamu                164
Name: County, dtype: int64

In [30]:
urban_pop = df['Urban/Rural'].str.contains('Urban').sum()
print(urban_pop)

12956

In [31]:
df[df['Urban/Rural'].str.contains('urban')]['Total'].sum()

0

In [32]:
df.sort_values(by='Total', ascending=False).head(10)

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
108,NAIROBI EAST,Urban,25,21383,23090,44473,Nairobi,NAIROBI,108
113,NAIROBI EAST,Urban,30,23060,18937,41997,Nairobi,NAIROBI,113
189,NAIROBI NORTH,Urban,25,20175,20637,40812,Nairobi,NAIROBI,189
107,NAIROBI EAST,Urban,24,18028,20785,38813,Nairobi,NAIROBI,107
106,NAIROBI EAST,Urban,23,16882,21301,38183,Nairobi,NAIROBI,106
105,NAIROBI EAST,Urban,22,15898,21697,37595,Nairobi,NAIROBI,105
194,NAIROBI NORTH,Urban,30,20554,16771,37325,Nairobi,NAIROBI,194
82,NAIROBI EAST,Urban,0,18237,18163,36400,Nairobi,NAIROBI,82
111,NAIROBI EAST,Urban,28,18264,18054,36318,Nairobi,NAIROBI,111
109,NAIROBI EAST,Urban,26,17238,18413,35651,Nairobi,NAIROBI,109

In [33]:
# Which 5 counties were the most densely populated Counties in descending order?
grouped_pop1 = df.groupby('County' )['Total'].sum().nlargest(5)
print(grouped_pop1)

County
Nairobi     3138369
Kiambu      1673785
Kakamega    1660651
Nakuru      1603325
Meru        1591533
Name: Total, dtype: int64

In [34]:
# What was the total population of Busia County?
Busia_pop = df[df['County'] == 'Busia']['Total'].sum()
print(Busia_pop)

743946

In [35]:
df['Total'].mean()

1518.8865853658538

In [36]:
df['Total'].sum()

38610097

In [37]:
# What was the average population of the the most sparsely populated county in Kenya?
grouped_pop = df.groupby('County')['Total'].mean().nsmallest(5)
print(grouped_pop)

County
Isiolo        436.871951
Marsabit      443.850610
Samburu       455.176829
Lamu          619.140244
Tana River    731.935976
Name: Total, dtype: float64

In [38]:
df.columns

Index(['District', 'Urban/Rural', 'Age_years', 'Male', 'Female', 'Total',
       'County', 'Province', 'OBJECTID'],
      dtype='object')

In [57]:
df.dropna(how='all', inplace=True)

In [58]:
# What was the average age of person in Busia County? How many people of this age were in Busia County?
x = df.loc[(df['Age_years'] != 'Age NS') & (df['Age_years'] != '80+')]
x.shape

(24800, 9)

In [59]:
# What was the average age of person in Busia County? How many people of this age were in Busia County?
y = df.groupby('County')
print(y)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001EFFB94E450>

In [60]:
#What was the Total population of Teso South District?
df[df['District']=='TESO SOUTH']['Total'].sum()

137924

In [61]:
#What was the urban population of Teso South District?
Teso_1 = df[df['District'] == 'TESO SOUTH']
Teso_1.head()

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
12874,TESO SOUTH,Urban,0,489,482,971,Busia,WESTERN,12874
12875,TESO SOUTH,Urban,1,395,387,782,Busia,WESTERN,12875
12876,TESO SOUTH,Urban,2,402,400,802,Busia,WESTERN,12876
12877,TESO SOUTH,Urban,3,407,445,852,Busia,WESTERN,12877
12878,TESO SOUTH,Urban,4,347,403,750,Busia,WESTERN,12878

In [62]:
Urban_Pop = Teso_1[Teso_1['Urban/Rural'] =='Urban']
Urban_Pop.tail(10)

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
12946,TESO SOUTH,Urban,72,12,9,21,Busia,WESTERN,12946
12947,TESO SOUTH,Urban,73,14,5,19,Busia,WESTERN,12947
12948,TESO SOUTH,Urban,74,8,5,13,Busia,WESTERN,12948
12949,TESO SOUTH,Urban,75,10,12,22,Busia,WESTERN,12949
12950,TESO SOUTH,Urban,76,7,14,21,Busia,WESTERN,12950
12951,TESO SOUTH,Urban,77,9,9,18,Busia,WESTERN,12951
12952,TESO SOUTH,Urban,78,3,2,5,Busia,WESTERN,12952
12953,TESO SOUTH,Urban,79,8,12,20,Busia,WESTERN,12953
12954,TESO SOUTH,Urban,80+,33,57,90,Busia,WESTERN,12954
12955,TESO SOUTH,Urban,Age NS,9,4,13,Busia,WESTERN,12955

In [63]:
Urban_Pop['Total'].sum()

26162

In [64]:
#What was the rural population of Teso South District?
Rural_Pop = Teso_1[Teso_1['Urban/Rural'] =='Rural']
Rural_Pop.tail(10)

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
25410,TESO SOUTH,Rural,72,85,96,181,Busia,WESTERN,25410
25411,TESO SOUTH,Rural,73,93,75,168,Busia,WESTERN,25411
25412,TESO SOUTH,Rural,74,91,124,215,Busia,WESTERN,25412
25413,TESO SOUTH,Rural,75,72,108,180,Busia,WESTERN,25413
25414,TESO SOUTH,Rural,76,66,59,125,Busia,WESTERN,25414
25415,TESO SOUTH,Rural,77,99,86,185,Busia,WESTERN,25415
25416,TESO SOUTH,Rural,78,63,47,110,Busia,WESTERN,25416
25417,TESO SOUTH,Rural,79,90,121,211,Busia,WESTERN,25417
25418,TESO SOUTH,Rural,80+,384,391,775,Busia,WESTERN,25418
25419,TESO SOUTH,Rural,Age NS,25,23,48,Busia,WESTERN,25419

In [65]:
Rural_Pop['Total'].sum()

111762

In [66]:
Teso_1 = df.groupby('District').sum().sort_values('Total', ascending=False)
Teso_1.tail()

C:\Users\USER\AppData\Local\Temp\ipykernel_8388\82918861.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  Teso_1 = df.groupby('District').sum().sort_values('Total', ascending=False)

                 Male  Female  Total  OBJECTID
District
SAMBURU NORTH   31471   28330  59801   2400386
SAMBURU EAST    29011   30083  59094   2386938
MARSABIT        23305   23197  46502   1485922
GARBATULLA      23314   19804  43118   1553162
LAIKIPIA NORTH  16928   15834  32762   2642450

In [67]:
df2 = df.loc[df['District'] == 'TESO SOUTH']
df5 = df2.loc[df2['Urban/Rural'] == 'Urban']
df5['Total'].sum()

26162

In [68]:
# What was the population of people aged 60 and above in Kenya?
#convert to integer

In [69]:
# Challenge 15
# What was the urban population in Kenya?
df.groupby('Urban/Rural').sum()

C:\Users\USER\AppData\Local\Temp\ipykernel_8388\1096979210.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Urban/Rural').sum()

                 Male    Female     Total   OBJECTID
Urban/Rural
Rural        12913647  13209075  26122722  239153000
Urban         6278811   6208564  12487375   83922490

In [70]:
df.groupby('Urban/Rural')['Total'].sum()

Urban/Rural
Rural    26122722
Urban    12487375
Name: Total, dtype: int64

In [71]:
df.dropna(axis=0, how='all')

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
0,NAIROBI WEST,Urban,0,10126,10116,20242,Nairobi,NAIROBI,0
1,NAIROBI WEST,Urban,1,8124,7989,16113,Nairobi,NAIROBI,1
2,NAIROBI WEST,Urban,2,8462,8627,17089,Nairobi,NAIROBI,2
3,NAIROBI WEST,Urban,3,8334,8420,16754,Nairobi,NAIROBI,3
4,NAIROBI WEST,Urban,4,7948,7820,15768,Nairobi,NAIROBI,4
...,...,...,...,...,...,...,...,...,...
25415,TESO SOUTH,Rural,77,99,86,185,Busia,WESTERN,25415
25416,TESO SOUTH,Rural,78,63,47,110,Busia,WESTERN,25416
25417,TESO SOUTH,Rural,79,90,121,211,Busia,WESTERN,25417
25418,TESO SOUTH,Rural,80+,384,391,775,Busia,WESTERN,25418
25419,TESO SOUTH,Rural,Age NS,25,23,48,Busia,WESTERN,25419

In [72]:
df.isna().sum()

District       0
Urban/Rural    0
Age_years      0
Male           0
Female         0
Total          0
County         0
Province       0
OBJECTID       0
dtype: int64

In [73]:
for index, row in df.iterrows():
    if 'Age NS' in row['Age_years'] or '80+' in row['Age_years']:
        print(row['Age_years'])

80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS
80+
Age NS

In [77]:

y = df.where(df['Age_years']!='80+') 
y.tail(10)

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
25410,TESO SOUTH,Rural,72,85.0,96.0,181.0,Busia,WESTERN,25410.0
25411,TESO SOUTH,Rural,73,93.0,75.0,168.0,Busia,WESTERN,25411.0
25412,TESO SOUTH,Rural,74,91.0,124.0,215.0,Busia,WESTERN,25412.0
25413,TESO SOUTH,Rural,75,72.0,108.0,180.0,Busia,WESTERN,25413.0
25414,TESO SOUTH,Rural,76,66.0,59.0,125.0,Busia,WESTERN,25414.0
25415,TESO SOUTH,Rural,77,99.0,86.0,185.0,Busia,WESTERN,25415.0
25416,TESO SOUTH,Rural,78,63.0,47.0,110.0,Busia,WESTERN,25416.0
25417,TESO SOUTH,Rural,79,90.0,121.0,211.0,Busia,WESTERN,25417.0
25418,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25419,TESO SOUTH,Rural,Age NS,25.0,23.0,48.0,Busia,WESTERN,25419.0

In [82]:
df['Age_years'].replace('80+', 81, inplace=True)

In [83]:
df['Age_years'].replace('Age NS', 0, inplace=True)

In [84]:
df['Age_years'].unique()

array(['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12',
       '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23',
       '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34',
       '35', '36', '37', '38', '39', '40', '41', '42', '43', '44', '45',
       '46', '47', '48', '49', '50', '51', '52', '53', '54', '55', '56',
       '57', '58', '59', '60', '61', '62', '63', '64', '65', '66', '67',
       '68', '69', '70', '71', '72', '73', '74', '75', '76', '77', '78',
       '79', 81, 0], dtype=object)

In [86]:
# What was the population of people aged 60 and above in Kenya?
#convert to integer
df['Age_years'] = df['Age_years'].astype(float)

In [111]:
y = df['Age_years'] >= 60
df[y].mean()

C:\Users\USER\AppData\Local\Temp\ipykernel_8388\1089964937.py:2: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df[y].mean()

Age_years       70.047619
Male           137.881260
Female         157.979109
Total          295.860369
OBJECTID     12739.041475
dtype: float64

In [108]:
y = df['Age_years'] >= 60
df.loc[y].head(20)

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
60,NAIROBI WEST,Urban,60.0,1342,926,2268,Nairobi,NAIROBI,60
61,NAIROBI WEST,Urban,61.0,606,396,1002,Nairobi,NAIROBI,61
62,NAIROBI WEST,Urban,62.0,643,402,1045,Nairobi,NAIROBI,62
63,NAIROBI WEST,Urban,63.0,533,354,887,Nairobi,NAIROBI,63
64,NAIROBI WEST,Urban,64.0,472,378,850,Nairobi,NAIROBI,64
65,NAIROBI WEST,Urban,65.0,631,462,1093,Nairobi,NAIROBI,65
66,NAIROBI WEST,Urban,66.0,309,267,576,Nairobi,NAIROBI,66
67,NAIROBI WEST,Urban,67.0,358,248,606,Nairobi,NAIROBI,67
68,NAIROBI WEST,Urban,68.0,294,199,493,Nairobi,NAIROBI,68
69,NAIROBI WEST,Urban,69.0,235,210,445,Nairobi,NAIROBI,69
70,NAIROBI WEST,Urban,70.0,400,415,815,Nairobi,NAIROBI,70
71,NAIROBI WEST,Urban,71.0,135,138,273,Nairobi,NAIROBI,71
72,NAIROBI WEST,Urban,72.0,205,178,383,Nairobi,NAIROBI,72
73,NAIROBI WEST,Urban,73.0,175,134,309,Nairobi,NAIROBI,73
74,NAIROBI WEST,Urban,74.0,128,91,219,Nairobi,NAIROBI,74
75,NAIROBI WEST,Urban,75.0,180,209,389,Nairobi,NAIROBI,75
76,NAIROBI WEST,Urban,76.0,130,106,236,Nairobi,NAIROBI,76
77,NAIROBI WEST,Urban,77.0,96,91,187,Nairobi,NAIROBI,77
78,NAIROBI WEST,Urban,78.0,98,114,212,Nairobi,NAIROBI,78
79,NAIROBI WEST,Urban,79.0,91,101,192,Nairobi,NAIROBI,79

In [105]:
df.loc[y].tail(10)

,District,Urban/Rural,Age_years,Male,Female,Total,County,Province,OBJECTID
25409,TESO SOUTH,Rural,71.0,96,85,181,Busia,WESTERN,25409
25410,TESO SOUTH,Rural,72.0,85,96,181,Busia,WESTERN,25410
25411,TESO SOUTH,Rural,73.0,93,75,168,Busia,WESTERN,25411
25412,TESO SOUTH,Rural,74.0,91,124,215,Busia,WESTERN,25412
25413,TESO SOUTH,Rural,75.0,72,108,180,Busia,WESTERN,25413
25414,TESO SOUTH,Rural,76.0,66,59,125,Busia,WESTERN,25414
25415,TESO SOUTH,Rural,77.0,99,86,185,Busia,WESTERN,25415
25416,TESO SOUTH,Rural,78.0,63,47,110,Busia,WESTERN,25416
25417,TESO SOUTH,Rural,79.0,90,121,211,Busia,WESTERN,25417
25418,TESO SOUTH,Rural,81.0,384,391,775,Busia,WESTERN,25418

In [102]:
df['Age_years'].mean()

39.52439024390244